In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [11]:
data = {
    'Country':['China', 'Japan', 'Russia'],
    'Capital':['Beijing', 'Tokyo', 'Moscow'],
    'Population':[1409867838, 142456745, 147894345]
}

# Series

In [17]:
s1 = pd.Series(data['Country'],index = ['a', 'b', 'c'])

In [18]:
s1

a     China
b     Japan
c    Russia
dtype: object

In [19]:
s1.values  # return numpy array

array(['China', 'Japan', 'Russia'], dtype=object)

In [20]:
s1.index

Index(['a', 'b', 'c'], dtype='object')

# Dataframe

In [22]:
df1 = pd.DataFrame(data)

In [23]:
df1

   Capital Country  Population
0  Beijing   China  1409867838
1    Tokyo   Japan   142456745
2   Moscow  Russia   147894345

In [24]:
df1['Country']

0     China
1     Japan
2    Russia
Name: Country, dtype: object

In [25]:
cou = df1['Country']

In [26]:
type(cou)   #DataFrame is made up  of series

pandas.core.series.Series

In [27]:
df1.iterrows()

In [32]:
for row in df1.iterrows():
    print(row),print(type(row)),print(len(row)),print(type(row[0])),print(type(row[1]))
    break

(0, Capital          Beijing
Country            China
Population    1409867838
Name: 0, dtype: object)
<class 'tuple'>
2
<class 'numpy.int64'>
<class 'pandas.core.series.Series'>

In [33]:
df1

   Capital Country  Population
0  Beijing   China  1409867838
1    Tokyo   Japan   142456745
2   Moscow  Russia   147894345

In [34]:
data

{'Capital': ['Beijing', 'Tokyo', 'Moscow'],
 'Country': ['China', 'Japan', 'Russia'],
 'Population': [1409867838, 142456745, 147894345]}

In [36]:
s1 = pd.Series(data['Capital'])
s2 = pd.Series(data['Country'])
s3 = pd.Series(data['Population'])

In [37]:
df_new = pd.DataFrame([s1,s2,s3])

In [38]:
df_new

            0          1          2
0     Beijing      Tokyo     Moscow
1       China      Japan     Russia
2  1409867838  142456745  147894345

In [39]:
df_new = df_new.T

In [40]:
df_new

         0       1           2
0  Beijing   China  1409867838
1    Tokyo   Japan   142456745
2   Moscow  Russia   147894345

In [41]:
df_new = pd.DataFrame([s1,s2,s3],index =['Capital', 'Country', 'Population'])

In [42]:
df_new

                     0          1          2
Capital        Beijing      Tokyo     Moscow
Country          China      Japan     Russia
Population  1409867838  142456745  147894345

In [43]:
df_new = df_new.T

In [44]:
df_new

   Capital Country  Population
0  Beijing   China  1409867838
1    Tokyo   Japan   142456745
2   Moscow  Russia   147894345